class Types:
    RECEIVE_TYPE = (
        ('ออกไปรับ', 'ออกไปรับ'),
        ('มาส่ง', 'มาส่ง'),
    )

    PO_STATUS_TYPE = (
        ('รอรับสินค้า', 'รอรับสินค้า'),
        ('รับสินค้าแล้ว', 'รับสินค้าแล้ว')
    )

    STOCK_LOCATION_TYPE = (
        ('IN', 'IN'),
        ('OUT', 'OUT'),
        ('CHANGED', 'CHANGED'),
    )

    OIL_TYPE = (
        ('IN', 'IN'),
        ('OUT', 'OUT'),
    )

    PART_TYPE = (
        ('ซ่อม', 'ซ่อม'),
        ('ซื้อใหม่', 'ซื้อใหม่')
    )

    CUSTOMER_TYPE = (
        ('ทั่วไป', 'ทั่วไป'),
        ('ช่าง', 'ช่าง')
    )

    PAYMENT_METHOD = (
        ('เงินสด', 'เงินสด'),
        ('โอนเงิน', 'โอนเงิน'),
        ('บัตรเครดิต', 'บัตรเครดิต'),
        ('ตัดเงินเติม', 'ตัดเงินเติม'),
        ('ชำระภายหลัง', 'ชำระภายหลัง')
    )

    PAYMENT_STATUS = (
        ('ชำระแล้ว', 'ชำระแล้ว'),
        ('ยังไม่ชำระ', 'ยังไม่ชำระ')
    )

    ORDER_STATUS = (
        ('ใบเสนอราคา', 'ใบเสนอราคา'),
        ('รับออเดอร์', 'รับออเดอร์'),
        ('ดำเนินการ', 'ดำเนินการ'),
        ('สำเร็จ', 'สำเร็จ')
    )

    DELIVERY_TYPE = (
        ('ออกไปส่ง', 'ออกไปส่ง'),
        ('จ้างรถข้างนอก', 'จ้างรถข้างนอก'),
        ('ลูกค้ามารับ', 'ลูกค้ามารับ')
    )

    UTIL_TYPE = (
        ('account_vat', 'account_vat'),
        ('account_no_vat', 'account_no_vat'),
        ('tel_contact', 'tel_contact')
    )
